tutorials/cases/canonical/stoichiometric/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions
restore0Dir
runApplication blockMesh
runApplication $(getApplication)
