tutorials/cases/canonical/stoichiometric/constant/reactions
species
(
    targas N2
);

reactions
(
);
